uhnp/src/DataProcessors/тн_ЗаполнениеКорректировокПоШаблонамСОтборами/тн_ЗаполнениеКорректировокПоШаблонамСОтборами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ЗаполнениеКорректировокПоШаблонамСОтборами</name>
  <comment>// Юдина Екатерина 17.06.2025 Выполнение задач №000054099</comment>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/ОтражениеДокументовПоШаблонам/ОтражениеДокументовПоШаблонам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтражениеДокументовПоШаблонам</name>
  <resources>
    <name>УдалитьСценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписиДоЗакрытияПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтбора</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>ДокументПервогоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписиПослеЗакрытияПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДокументСторноПервогоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтражения</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>ДокументПоследнегоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияПериодаОтражения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроведениеОтменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеФоновымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>DocumentRef.УчетнаяПолитикаМСФО</types>
    </type>
  </resources>
  <resources>
    <name>ОтраженоВСледующемПериоде</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособТрансляции</name>
    <type>
      <types>EnumRef.СпособыТрансляции</types>
    </type>
  </resources>
  <dimensions>
    <name>ИсходныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбработкаВыполнена</name>
    <type>
      <types>EnumRef.ДаНет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонОперации</name>
    <type>
      <types>CatalogRef.ШаблоныТрансформационныхКорректировок</types>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трансляция</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтражения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/УчетныеПолитикиМСФО/УчетныеПолитикиМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетныеПолитикиМСФО</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>DocumentRef.УчетнаяПолитикаМСФО</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ДаНет/ДаНет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДаНет</name>
  <enumValues>
    <name>да</name>
  </enumValues>
  <enumValues>
    <name>нет</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыТрансляции/СпособыТрансляции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыТрансляции</name>
  <enumValues>
    <name>СводныеПоДатам</name>
  </enumValues>
  <enumValues>
    <name>ПоДокументамОбработка</name>
  </enumValues>
  <enumValues>
    <name>ПоДокументамФоновоеЗадание</name>
  </enumValues>
  <enumValues>
    <name>ПоДокументамПриПроведении</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ШаблоныТрансформационныхКорректировок/ШаблоныТрансформационныхКорректировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныТрансформационныхКорректировок</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрБухгалтерии</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетДатыОтраженияВУчете</name>
    <type>
      <types>EnumRef.СпособыРасчетаДатыОтраженияВУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвиженияПоРегиструБухгалтерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкиЗначенийПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпособОбработкиКорректировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпособРасчетаДатыСторнирования</name>
    <type>
      <types>EnumRef.СпособыВычисленияПараметровОперандов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУточнениеСпособаОпределенияДатыСторнирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеВСледующемПериоде</name>
    <type>
      <types>EnumRef.ДействияКорректировкиВСледующемПериоде</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленДополнительныйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляОнлайнПроводок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ПереформированиеПроводок</name>
    <comment>ВЗ №000043666</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ТипУчета</name>
    <comment>Выполнение задач № 000043769</comment>
    <type>
      <types>EnumRef.тн_ТипыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_ИспользоватьДатуФормированияПроводок</name>
    <comment>№000045560</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_РеквизитДатыФормированияПроводок</name>
    <comment>№000045560</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ДатаНачалаИспользования</name>
    <comment>// Гутарова Екатерина 09.11.2023 Выполнение задач №000047426</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>тн_ДатаОкончанияИспользования</name>
    <comment>// Сафиуллина З.Р. 10.06.2024 Выполнение задач №000049838</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьСвязанныеДокументы</name>
    <attributes>
      <name>ДокументБД</name>
      <type>
        <types>CatalogRef.ДокументыБД</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокументаБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаПараметровОтбораБД</name>
    <attributes>
      <name>ПолеБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВычисленияПараметра</name>
      <type>
        <types>EnumRef.СпособыВычисленияПараметровОперандов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДляПроверки</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстМодуля</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УточненияСпособовОпределения</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолеБД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/тн_ЗаполнениеКорректировокПоШаблонамСОтборами/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных
	
Перем ТабОбработанныхДокументов Экспорт;
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьКорректировки(СтруктураРеквизитов) Экспорт
	
	ТабОбработанныхДокументов = Новый ТаблицаЗначений;
	ТабОбработанныхДокументов.Колонки.Добавить("ШаблонКорректировки");
	ТабОбработанныхДокументов.Колонки.Добавить("ИсходныйДокумент");
	
	РезультатЗапросаДанных = Новый Структура;
	РезультатЗапросаДанных.Вставить("ЕстьОшибки", Ложь); 
	РезультатЗапросаДанных.Вставить("ТекстОшибки", "");      
	
	Если ЗначениеЗаполнено(СтруктураРеквизитов.ШаблоныКорректировки) Тогда
		
		ОбработатьКорректировкиПоШаблонам(СтруктураРеквизитов);
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураРеквизитов.ВидыДокумента) Тогда
		
		ОбработатьКорректировкиПоДокументам(СтруктураРеквизитов);
		
	Иначе
		
		ПерезаполнитьКорректировкиПоВсемШаблонам(СтруктураРеквизитов);
			
	КонецЕсли; 
				
	РезультатЗапросаДанных.Вставить("Результат", ТабОбработанныхДокументов);
	Возврат РезультатЗапросаДанных;
				
 КонецФункции 

Процедура ОбработатьКорректировкиПоДокументам(СтруктураРеквизитов)
	
	ТаблицаШаблоновКорректировок = ПолучитьТаблицуШаблоновКорректировок(СтруктураРеквизитов);
	
	Для Каждого Строка Из ТаблицаШаблоновКорректировок Цикл
		
		Если СтруктураРеквизитов.СоздаватьНовые Тогда
			
			ОбновитьСоздатьКорректировкиПоШаблону(Строка.РабочийШаблон, Строка.ИмяДокумента, СтруктураРеквизитов);
			
		Иначе
			
			ПерезаполнитьКорректировкиПоШаблону(Строка.РабочийШаблон, Строка.ИмяДокумента, СтруктураРеквизитов);
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры 

Функция ПолучитьТаблицуШаблоновКорректировок(СтруктураРеквизитов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ШаблоныТрансформационныхКорректировок.Ссылка КАК РабочийШаблон,
	               |	ШаблоныТрансформационныхКорректировок.ДокументБД.Наименование КАК ИмяДокумента
	               |ИЗ
	               |	Справочник.ШаблоныТрансформационныхКорректировок КАК ШаблоныТрансформационныхКорректировок
	               |ГДЕ
	               |	ШаблоныТрансформационныхКорректировок.ДокументБД В(&ВидыДокумента)
	               |	И НЕ ШаблоныТрансформационныхКорректировок.ПометкаУдаления";
	Запрос.УстановитьПараметр("ВидыДокумента", СтруктураРеквизитов.ВидыДокумента);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

Процедура ОбработатьКорректировкиПоШаблонам(СтруктураРеквизитов)
	
	МассивИменДокументовБД = ПолучитьМассивДокументовБД(СтруктураРеквизитов);
	
	Для Каждого Строка Из МассивИменДокументовБД Цикл
		
		Если СтруктураРеквизитов.СоздаватьНовые Тогда
			
			ОбновитьСоздатьКорректировкиПоШаблону(Строка.ШаблонКорректировки,Строка.ИмяДокумента, СтруктураРеквизитов);
			
		Иначе
			
			ПерезаполнитьКорректировкиПоШаблону(Строка.ШаблонКорректировки,Строка.ИмяДокумента, СтруктураРеквизитов);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры 

Процедура ПерезаполнитьКорректировкиПоВсемШаблонам(СтруктураРеквизитов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОтражениеДокументовПоШаблонам.ШаблонОперации КАК ШаблонОперации
	|ПОМЕСТИТЬ ШаблоныКорректировок
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовПоШаблонам КАК ОтражениеДокументовПоШаблонам
	|ГДЕ
	|	НЕ ОтражениеДокументовПоШаблонам.ПроведениеОтменено
	|И ОтражениеДокументовПоШаблонам.ШаблонОперации ССЫЛКА Справочник.ШаблоныТрансформационныхКорректировок";
	
	Если СтруктураРеквизитов.ТолькоНеобработанные Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ОтражениеДокументовПоШаблонам.ОбработкаВыполнена = ЗНАЧЕНИЕ(Перечисление.ДаНет.нет)";
		
	КонецЕсли;	
	
	
	Если СтруктураРеквизитов.Свойство("Организации")
		И ЗначениеЗаполнено(СтруктураРеквизитов.Организации) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ОтражениеДокументовПоШаблонам.Организация В (&Организации)";
		
	КонецЕсли;	
 	Если СтруктураРеквизитов.Свойство("УчетныеПолитики")
		И ЗначениеЗаполнено(СтруктураРеквизитов.УчетныеПолитики) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ОтражениеДокументовПоШаблонам.УчетнаяПолитика В (&УчетныеПолитики)";
		
	КонецЕсли;	
	
	Запрос.Текст = Запрос.Текст + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ШаблонОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныТрансформационныхКорректировок.Ссылка КАК ШаблонКорректировки,
	|	ШаблоныТрансформационныхКорректировок.ДокументБД.Наименование КАК НаименованиеДокументаБД
	|ИЗ
	|	Справочник.ШаблоныТрансформационныхКорректировок КАК ШаблоныТрансформационныхКорректировок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШаблоныКорректировок КАК ШаблоныКорректировок
	|		ПО ШаблоныТрансформационныхКорректировок.Ссылка = ШаблоныКорректировок.ШаблонОперации";
	
	Запрос.УстановитьПараметр("Организации", СтруктураРеквизитов.Организации);
	Запрос.УстановитьПараметр("УчетныеПолитики", СтруктураРеквизитов.УчетныеПолитики);
	
	Результат = Запрос.Выполнить().Выбрать();
		
	Пока Результат.Следующий() Цикл
		
		ПерезаполнитьКорректировкиПоШаблону(Результат.ШаблонКорректировки, Результат.НаименованиеДокументаБД, СтруктураРеквизитов);
		
	КонецЦикла;	
	
КонецПроцедуры 

Процедура ОбновитьКорректировкиПоДокументу(ДанныеОтражения, РабочийШаблон, КэшДанныхЗакрытия)
		
	НаборЗаписей = РегистрыСведений.ОтражениеДокументовПоШаблонам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИсходныйДокумент.Установить(ДанныеОтражения.ИсходныйДокумент);
	НаборЗаписей.Отбор.ШаблонОперации.Установить(РабочийШаблон); 
	НаборЗаписей.Отбор.Организация.Установить(ДанныеОтражения.Организация);
	
	ДанныеЗакрытияПериода = ПолучитьДанныеЗакрытияПериода(ДанныеОтражения.Организация,КэшДанныхЗакрытия);
	
	НаборЗаписей.Прочитать();
	
	КорректировкиЗначенийПоказателей32.ОбработатьНаборЗаписейПоПериодам(НаборЗаписей,ДанныеЗакрытияПериода);
	
	Для Каждого ДанныеОбъекта Из НаборЗаписей Цикл
				
		РегистрыСведений.ОтражениеДокументовПоШаблонам.ВыполнитьОтражениеОбъекта(ДанныеОбъекта);
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	НоваяСтрока = ТабОбработанныхДокументов.Добавить();
	НоваяСтрока.ШаблонКорректировки = РабочийШаблон;
	НоваяСтрока.ИсходныйДокумент = ДанныеОтражения.ИсходныйДокумент;
	
КонецПроцедуры

Функция ПолучитьМассивДокументовБД(СтруктураРеквизитов)	
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ  
		|	ШаблоныТрансформационныхКорректировок.Ссылка КАК ШаблонКорректировки,
	               |	ШаблоныТрансформационныхКорректировок.ДокументБД.Наименование КАК ИмяДокумента
		             |ИЗ
		             |	Справочник.ШаблоныТрансформационныхКорректировок КАК ШаблоныТрансформационныхКорректировок
		             |ГДЕ
		             |	ШаблоныТрансформационныхКорректировок.Ссылка В(&ШаблоныКорректировки)";
		
		Запрос.УстановитьПараметр("ШаблоныКорректировки", СтруктураРеквизитов.ШаблоныКорректировки);
		
		Возврат Запрос.Выполнить().Выгрузить();
			
КонецФункции 

Процедура ПерезаполнитьКорректировкиПоШаблону(РабочийШаблон, ИмяДокумента, СтруктураРеквизитов)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОтражениеДокументовПоШаблонам.ИсходныйДокумент КАК ИсходныйДокумент,
	|	ОтражениеДокументовПоШаблонам.Организация КАК Организация,
	|ВЫРАЗИТЬ(ОтражениеДокументовПоШаблонам.ИсходныйДокумент КАК Документ." + ИмяДокумента + ").Дата КАК ДатаДокумента
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовПоШаблонам КАК ОтражениеДокументовПоШаблонам
	|ГДЕ
	|	ОтражениеДокументовПоШаблонам.ШаблонОперации = &ШаблонОперации
	|	И НЕ ОтражениеДокументовПоШаблонам.ПроведениеОтменено
	|	И ОтражениеДокументовПоШаблонам.ИсходныйДокумент ССЫЛКА Документ." + ИмяДокумента;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитов.ПериодОбработки.ДатаНачала) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ВЫРАЗИТЬ(ОтражениеДокументовПоШаблонам.ИсходныйДокумент КАК Документ." + ИмяДокумента + ").Дата >= &ДатаНач";
		Запрос.УстановитьПараметр("ДатаНач",СтруктураРеквизитов.ПериодОбработки.ДатаНачала);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитов.ПериодОбработки.ДатаОкончания) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ВЫРАЗИТЬ(ОтражениеДокументовПоШаблонам.ИсходныйДокумент КАК Документ." + ИмяДокумента + ").Дата <= &ДатаКон";
		Запрос.УстановитьПараметр("ДатаКон", СтруктураРеквизитов.ПериодОбработки.ДатаОкончания);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РабочийШаблон.тн_ДатаНачалаИспользования) Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|	И ВЫРАЗИТЬ(ОтражениеДокументовПоШаблонам.ИсходныйДокумент КАК Документ." + ИмяДокумента + ").Дата >= &ДатаНачалаИспользованияШаблона";		
		Запрос.УстановитьПараметр("ДатаНачалаИспользованияШаблона", РабочийШаблон.тн_ДатаНачалаИспользования);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РабочийШаблон.тн_ДатаОкончанияИспользования) Тогда
		
		Запрос.Текст=Запрос.Текст+"
		|	И ВЫРАЗИТЬ(ОтражениеДокументовПоШаблонам.ИсходныйДокумент КАК Документ." + ИмяДокумента + ").Дата <= &ДатаОкончанияИспользованияШаблона";		
		Запрос.УстановитьПараметр("ДатаОкончанияИспользованияШаблона", РабочийШаблон.тн_ДатаОкончанияИспользования);
		
	КонецЕсли;	
	
	Если СтруктураРеквизитов.ТолькоНеобработанные Тогда
		
		Запрос.Текст = Запрос.Текст+"
		|	И ОтражениеДокументовПоШаблонам.ОбработкаВыполнена = ЗНАЧЕНИЕ(Перечисление.ДаНет.нет)";
		
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("Организации")
		И ЗначениеЗаполнено(СтруктураРеквизитов.Организации) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ОтражениеДокументовПоШаблонам.Организация В (&Организации)";
		Запрос.УстановитьПараметр("Организации", СтруктураРеквизитов.Организации);
	
	КонецЕсли;
	
 	Если СтруктураРеквизитов.Свойство("УчетныеПолитики")
		И ЗначениеЗаполнено(СтруктураРеквизитов.УчетныеПолитики) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ОтражениеДокументовПоШаблонам.УчетнаяПолитика В (&УчетныеПолитики)";
		
		Запрос.УстановитьПараметр("УчетныеПолитики", СтруктураРеквизитов.УчетныеПолитики);	
		
	КонецЕсли;	
	Запрос.Текст = Запрос.Текст + "
	|Упорядочить ПО
	|ВЫРАЗИТЬ(ОтражениеДокументовПоШаблонам.ИсходныйДокумент КАК Документ." + ИмяДокумента + ").Дата";
	
	Запрос.УстановитьПараметр("ШаблонОперации", РабочийШаблон);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	КэшДанныхЗакрытия = Новый Соответствие;
	
	Пока Результат.Следующий() Цикл
		
		ОбновитьКорректировкиПоДокументу(Результат, РабочийШаблон, КэшДанныхЗакрытия);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеЗакрытияПериода(Организация,КэшДанныхЗакрытия)
	
	ДанныеЗакрытияПериода = КэшДанныхЗакрытия.Получить(Организация);
	
	Если ДанныеЗакрытияПериода = Неопределено Тогда
		
		ДанныеЗакрытияПериода = УправлениеОтчетамиУХ.ПолучитьДанныеЗакрытогоПериода(Организация);
		КэшДанныхЗакрытия.Вставить(Организация, ДанныеЗакрытияПериода);
		
	КонецЕсли;
	
	Возврат ДанныеЗакрытияПериода;
			
КонецФункции 

Процедура ОбновитьСоздатьКорректировкиПоШаблону(РабочийШаблон, ИмяДокумента, СтруктураРеквизитов)
	
	ДокументМД = Метаданные.Документы[ИмяДокумента];
	
	ЕстьСценарий = ОбщегоНазначенияУХ.ЕстьРеквизитОбъектаМД("Сценарий", ДокументМД);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыКОбработке.Ссылка КАК ИсходныйДокумент,
	|	ДокументыКОбработке.Организация КАК Организация,
	|	ДокументыКОбработке.Дата КАК Дата,";
	
	Если ЕстьСценарий Тогда
		
		Запрос.Текст = Запрос.Текст + "		
		|	ДокументыКОбработке.Сценарий КАК Сценарий";
		
	Иначе
		
		Запрос.Текст = Запрос.Текст + "		
		|	Неопределено КАК Сценарий";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст+"			
	|ИЗ
	|	Документ." + ИмяДокумента + " КАК ДокументыКОбработке
	|ГДЕ
	|	ДокументыКОбработке.Проведен";
	
	Если ЗначениеЗаполнено(РабочийШаблон.тн_ДатаНачалаИспользования) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ДокументыКОбработке.Дата >= &ДатаНачалаИспользованияШаблона";
		
		Запрос.УстановитьПараметр("ДатаНачалаИспользованияШаблона", РабочийШаблон.тн_ДатаНачалаИспользования);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РабочийШаблон.тн_ДатаОкончанияИспользования) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ДокументыКОбработке.Дата <= &ДатаОкончанияИспользованияШаблона";
		
		Запрос.УстановитьПараметр("ДатаОкончанияИспользованияШаблона", РабочийШаблон.тн_ДатаОкончанияИспользования);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитов.ПериодОбработки.ДатаНачала) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ДокументыКОбработке.Дата >= &ДатаНач";
		Запрос.УстановитьПараметр("ДатаНач", СтруктураРеквизитов.ПериодОбработки.ДатаНачала);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитов.ПериодОбработки.ДатаОкончания) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ДокументыКОбработке.Дата <= &ДатаКон";
		
		Запрос.УстановитьПараметр("ДатаКон",СтруктураРеквизитов.ПериодОбработки.ДатаОкончания);
		
	КонецЕсли;  
	
	Если СтруктураРеквизитов.Свойство("Организации")
		И ЗначениеЗаполнено(СтруктураРеквизитов.Организации) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ДокументыКОбработке.Организация В (&Организации)";
		
		Запрос.УстановитьПараметр("Организации", СтруктураРеквизитов.Организации);
	
	КонецЕсли;	

	Результат = Запрос.Выполнить().Выбрать();
	
	ПланСчетовМСФО = РабочийШаблон.ПланСчетов.ПланСчетовМСФО;
	
	Пока Результат.Следующий() Цикл 
		
		ДанныеДляОтражения = Новый Структура;
		ДанныеДляОтражения.Вставить("ИсходныйДокумент",	Результат.ИсходныйДокумент);
		ДанныеДляОтражения.Вставить("Организация",		Результат.Организация);
		ДанныеДляОтражения.Вставить("Период",			Результат.Дата);
			
		Если НЕ Результат.Сценарий = Неопределено Тогда
			
			ДанныеДляОтражения.Вставить("Сценарий",Результат.Сценарий);
			
		ИначеЕсли ПланСчетовМСФО Тогда
			
			ДанныеДляОтражения.Вставить("Сценарий",Константы.СценарийМСФО.Получить());
			
		Иначе
			
			ДанныеДляОтражения.Вставить("Сценарий",Справочники.Сценарии.Факт);
			
		КонецЕсли; 
		
		ДанныеУчетнойПолитики = КорректировкиЗначенийПоказателей32.ПолучитьДанныеУчетнойПолитики(ДанныеДляОтражения.Организация,
													ДанныеДляОтражения.Сценарий,
													ДанныеДляОтражения.Период);
	
		Если (Не ЗначениеЗаполнено(ДанныеУчетнойПолитики.СпособТрансляции))
			Или ДанныеУчетнойПолитики.СпособТрансляции = Перечисления.СпособыТрансляции.СводныеПоДатам Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		ДанныеДляОтражения.Вставить("СпособТрансляции",			ДанныеУчетнойПолитики.СпособТрансляции);
		ДанныеДляОтражения.Вставить("УчетнаяПолитика",			ДанныеУчетнойПолитики.УчетнаяПолитика);
		ДанныеДляОтражения.Вставить("ДействиеВЗакрытомПериоде",	ДанныеУчетнойПолитики.ДействиеВЗакрытомПериоде);
		
		ОтборДляПолученияУчетнойПолитики = Новый Структура;
        ОтборДляПолученияУчетнойПолитики.Вставить("Организация",ДанныеДляОтражения.Организация);
        ОтборДляПолученияУчетнойПолитики.Вставить("Сценарий",   ДанныеДляОтражения.Сценарий);
		УчетнаяПолитикаМСФО = РегистрыСведений.УчетныеПолитикиМСФО.ПолучитьПоследнее(ДанныеДляОтражения.Период,ОтборДляПолученияУчетнойПолитики);

		Если УчетнаяПолитикаМСФО = Неопределено Тогда
		   ДанныеДляОтражения.Вставить("УчетнаяПолитика", Документы.УчетнаяПолитикаМСФО.ПустаяСсылка()); 
		   ДанныеДляОтражения.Вставить("СпособТрансляции",Константы.СпособТрансляции.Получить());
	   	Иначе
		   УчПолитика = УчетнаяПолитикаМСФО.УчетнаяПолитика;
		   ДанныеДляОтражения.Вставить("УчетнаяПолитика", УчПолитика); 
		   ДанныеДляОтражения.Вставить("СпособТрансляции",?(ЗначениеЗаполнено(УчПолитика.СпособТрансляции),УчПолитика.СпособТрансляции, Константы.СпособТрансляции.Получить()));
		КонецЕсли;  
	
		Обработки.КорректировкиЗначенийПоказателей.СформироватьКорректировкуПоШаблону(РабочийШаблон,ДанныеДляОтражения,Ложь);
		НоваяСтрока = ТабОбработанныхДокументов.Добавить();
		НоваяСтрока.ШаблонКорректировки = РабочийШаблон;
		НоваяСтрока.ИсходныйДокумент = Результат.ИсходныйДокумент;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
